experiments/workflow/beldi-movie/expected_results/qps150/wrk.log
Running 2m test @ http://ip-172-31-15-142.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 1.019ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.094ms, rate sampling interval: 34ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.52ms    7.02ms  47.49ms   94.76%
    Req/Sec    77.49     43.42   444.00     77.26%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96ms
 75.000%    1.24ms
 90.000%    1.40ms
 99.000%   43.46ms
 99.900%   43.49ms
 99.990%   47.49ms
 99.999%   47.52ms
100.000%   47.52ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.215     0.000000            1         1.00
       0.508     0.100000         2107         1.11
       0.621     0.200000         4219         1.25
       0.730     0.300000         6314         1.43
       0.839     0.400000         8416         1.67
       0.964     0.500000        10523         2.00
       1.021     0.550000        11555         2.22
       1.073     0.600000        12606         2.50
       1.127     0.650000        13651         2.86
       1.184     0.700000        14708         3.33
       1.236     0.750000        15755         4.00
       1.260     0.775000        16277         4.44
       1.283     0.800000        16815         5.00
       1.310     0.825000        17331         5.71
       1.336     0.850000        17859         6.67
       1.363     0.875000        18375         8.00
       1.381     0.887500        18652         8.89
       1.400     0.900000        18901        10.00
       1.425     0.912500        19161        11.43
       1.475     0.925000        19425        13.33
       4.171     0.937500        19687        16.00
       4.215     0.943750        19824        17.78
      17.247     0.950000        19961        20.00
      17.311     0.956250        20115        22.86
      17.359     0.962500        20236        26.67
      30.367     0.968750        20397        32.00
      30.383     0.971875        20445        35.56
      30.399     0.975000        20481        40.00
      30.447     0.978125        20547        45.71
      30.495     0.981250        20614        53.33
      43.455     0.984375        20868        64.00
      43.455     0.985938        20868        71.11
      43.455     0.987500        20868        80.00
      43.455     0.989062        20868        91.43
      43.455     0.990625        20868       106.67
      43.455     0.992188        20868       128.00
      43.455     0.992969        20868       142.22
      43.455     0.993750        20868       160.00
      43.487     0.994531        20987       182.86
      43.487     0.995313        20987       213.33
      43.487     0.996094        20987       256.00
      43.487     0.996484        20987       284.44
      43.487     0.996875        20987       320.00
      43.487     0.997266        20987       365.71
      43.487     0.997656        20987       426.67
      43.487     0.998047        20987       512.00
      43.487     0.998242        20987       568.89
      43.487     0.998437        20987       640.00
      43.487     0.998633        20987       731.43
      43.487     0.998828        20987       853.33
      43.487     0.999023        20987      1024.00
      43.487     0.999121        20987      1137.78
      43.487     0.999219        20987      1280.00
      43.487     0.999316        20987      1462.86
      43.487     0.999414        20987      1706.67
      43.519     0.999512        20991      2048.00
      43.519     0.999561        20991      2275.56
      43.519     0.999609        20991      2560.00
      43.519     0.999658        20991      2925.71
      44.255     0.999707        20993      3413.33
      44.255     0.999756        20993      4096.00
      44.287     0.999780        20994      4551.11
      44.287     0.999805        20994      5120.00
      44.319     0.999829        20995      5851.43
      44.319     0.999854        20995      6826.67
      47.487     0.999878        20997      8192.00
      47.487     0.999890        20997      9102.22
      47.487     0.999902        20997     10240.00
      47.487     0.999915        20997     11702.86
      47.487     0.999927        20997     13653.33
      47.487     0.999939        20997     16384.00
      47.487     0.999945        20997     18204.44
      47.487     0.999951        20997     20480.00
      47.519     0.999957        20998     23405.71
      47.519     1.000000        20998          inf
#[Mean    =        2.520, StdDeviation   =        7.022]
#[Max     =       47.488, Total count    =        20998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  196.00us
 75.000%  232.00us
 90.000%  260.00us
 99.000%   42.78ms
 99.900%   42.94ms
 99.990%   46.75ms
 99.999%   46.94ms
100.000%   46.94ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.127     0.000000            1         1.00
       0.161     0.100000         2148         1.11
       0.171     0.200000         4336         1.25
       0.179     0.300000         6587         1.43
       0.186     0.400000         8436         1.67
       0.196     0.500000        10604         2.00
       0.202     0.550000        11577         2.22
       0.209     0.600000        12626         2.50
       0.217     0.650000        13736         2.86
       0.224     0.700000        14768         3.33
       0.232     0.750000        15870         4.00
       0.235     0.775000        16284         4.44
       0.239     0.800000        16806         5.00
       0.244     0.825000        17413         5.71
       0.248     0.850000        17872         6.67
       0.254     0.875000        18420         8.00
       0.257     0.887500        18674         8.89
       0.260     0.900000        18939        10.00
       0.264     0.912500        19208        11.43
       0.268     0.925000        19468        13.33
       0.272     0.937500        19688        16.00
       0.275     0.943750        19828        17.78
       0.278     0.950000        19956        20.00
       0.282     0.956250        20103        22.86
       0.286     0.962500        20216        26.67
       0.292     0.968750        20348        32.00
       0.296     0.971875        20416        35.56
       0.300     0.975000        20478        40.00
       0.308     0.978125        20548        45.71
       0.319     0.981250        20606        53.33
      42.655     0.984375        20672        64.00
      42.719     0.985938        20727        71.11
      42.751     0.987500        20752        80.00
      42.783     0.989062        20806        91.43
      42.783     0.990625        20806       106.67
      42.815     0.992188        20861       128.00
      42.815     0.992969        20861       142.22
      42.847     0.993750        20909       160.00
      42.847     0.994531        20909       182.86
      42.847     0.995313        20909       213.33
      42.879     0.996094        20950       256.00
      42.879     0.996484        20950       284.44
      42.879     0.996875        20950       320.00
      42.879     0.997266        20950       365.71
      42.879     0.997656        20950       426.67
      42.911     0.998047        20966       512.00
      42.911     0.998242        20966       568.89
      42.911     0.998437        20966       640.00
      42.943     0.998633        20984       731.43
      42.943     0.998828        20984       853.33
      42.943     0.999023        20984      1024.00
      42.943     0.999121        20984      1137.78
      42.943     0.999219        20984      1280.00
      42.943     0.999316        20984      1462.86
      42.975     0.999414        20991      1706.67
      42.975     0.999512        20991      2048.00
      42.975     0.999561        20991      2275.56
      42.975     0.999609        20991      2560.00
      42.975     0.999658        20991      2925.71
      43.871     0.999707        20992      3413.33
      43.903     0.999756        20993      4096.00
      43.935     0.999780        20994      4551.11
      43.935     0.999805        20994      5120.00
      43.967     0.999829        20995      5851.43
      43.967     0.999854        20995      6826.67
      46.751     0.999878        20996      8192.00
      46.751     0.999890        20996      9102.22
      46.751     0.999902        20996     10240.00
      46.847     0.999915        20997     11702.86
      46.847     0.999927        20997     13653.33
      46.847     0.999939        20997     16384.00
      46.847     0.999945        20997     18204.44
      46.847     0.999951        20997     20480.00
      46.943     0.999957        20998     23405.71
      46.943     1.000000        20998          inf
#[Mean    =        0.948, StdDeviation   =        5.583]
#[Max     =       46.912, Total count    =        20998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22502 requests in 2.50m, 3.50MB read
Requests/sec:    150.01
Transfer/sec:     23.88KB